test/request-response-samples/UpdateProfile__correct_namespaces_for_elements_with_base/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.bigdatacollect.or" xmlns:c="http://www.bigdatacollect.or/Common/Types" xmlns:n="http://www.bigdatacollect.or/Name/Types"><SOAP-ENV:Body><n:UpdateProfileRequest xmlns:n="http://www.bigdatacollect.or/Name/Types" xmlns="http://www.bigdatacollect.or/Name/Types"><n:Profile><n:IDs><c:UniqueID source="TESTSOURCE">100</c:UniqueID></n:IDs><n:Addresses><n:NameAddress><c:AddressLine>Another Address</c:AddressLine></n:NameAddress><n:NameAddress><c:AddressLine>My Address</c:AddressLine></n:NameAddress></n:Addresses><n:Phones><n:NamePhone primary="true"><c:PhoneData><c:PhoneNumber>123</c:PhoneNumber></c:PhoneData></n:NamePhone><n:NamePhone primary="false"><c:PhoneData><c:PhoneNumber>456</c:PhoneNumber></c:PhoneData></n:NamePhone></n:Phones></n:Profile></n:UpdateProfileRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>